angular.module("myApp")
//------------------------------下拉列表--------------
    .constant('type', {
        "首页banner": "0",
        "找职位": "1",
        "找精英": "2",
        "行业大图": "3"
    })

    .constant('state', {
        "草稿": 1,
        "上线": 2
    })
    //---------------------------编辑&新增----------------------
    .constant('redactTypes', {
        "首页banner": 0,
        "找职位": 1,
        "找精英": 2,
        "行业大图": 3
    })
    .constant('industries', {
        "移动互联网": 0,
        "电子商务": 1,
        "企业服务": 2,
        "O2O": 3,
        "教育": 4,
        "金融": 5,
        "保险": 6
    })
    //-------------------------过滤器----------------------
    .constant('types', {
        0: "首页banner",
        1: "找职位",
        2: "找精英",
        3: "行业大图"
    })
    .constant('states', {
        1: "草稿",
        2: "上线"
    })
    .constant('status', {
        1: "下线",
        2: "上线"
    });